### 🔍 Infrastructure Validation Report

<details>
<summary>**📋 Terraform Plan Insights **</summary>

```terraform
[command]/home/runner/work/_temp/eb38195d-9e3d-44cd-af59-5d440073b691/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.ec2 will be created
  + resource "aws_instance" "ec2" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops-dojo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "gitops"
        }
      + tags_all                             = {
          + "Name" = "gitops"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0ae4242928617e4b6",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_route53_record.main_domain_record will be created
  + resource "aws_route53_record" "main_domain_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "afeezadeboye.site"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0147908X57MCN3YH0SW"
    }

  # aws_route53_record.wildcard_domain_record will be created
  + resource "aws_route53_record" "wildcard_domain_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.afeezadeboye.site"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0147908X57MCN3YH0SW"
    }

  # aws_route_table_association.rt_association must be replaced
-/+ resource "aws_route_table_association" "rt_association" {
      ~ id             = "rtbassoc-0ee3ef3f1200008b3" -> (known after apply)
      ~ subnet_id      = "subnet-0d697670413be14ce" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet must be replaced
-/+ resource "aws_subnet" "public_subnet" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:851725267635:subnet/subnet-0d697670413be14ce" -> (known after apply)
      ~ availability_zone                              = "us-east-1e" -> "us-east-1a" # forces replacement
      ~ availability_zone_id                           = "use1-az3" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0d697670413be14ce" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "851725267635" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "MainSubnet"
        }
        # (12 unchanged attributes hidden)
    }

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../ansible/inventory.ini"
      + id                   = (known after apply)
    }

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./devops-dojo"
      + id                   = (known after apply)
    }

Plan: 7 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - db_domain         = "db.afeezadeboye.site" -> null
  - frontend_domain   = "afeezadeboye.site" -> null
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.ec2 will be created%0A  + resource "aws_instance" "ec2" {%0A      + ami                                  = "ami-005fc0f236362e99f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = "us-east-1a"%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t3.medium"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "devops-dojo"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "gitops"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "gitops"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = [%0A          + "sg-0ae4242928617e4b6",%0A        ]%0A%0A      + capacity_reservation_specification (known after apply)%0A%0A      + cpu_options (known after apply)%0A%0A      + ebs_block_device (known after apply)%0A%0A      + enclave_options (known after apply)%0A%0A      + ephemeral_block_device (known after apply)%0A%0A      + instance_market_options (known after apply)%0A%0A      + maintenance_options (known after apply)%0A%0A      + metadata_options (known after apply)%0A%0A      + network_interface (known after apply)%0A%0A      + private_dns_name_options (known after apply)%0A%0A      + root_block_device (known after apply)%0A    }%0A%0A  # aws_route53_record.main_domain_record will be created%0A  + resource "aws_route53_record" "main_domain_record" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "afeezadeboye.site"%0A      + records         = (known after apply)%0A      + ttl             = 300%0A      + type            = "A"%0A      + zone_id         = "Z0147908X57MCN3YH0SW"%0A    }%0A%0A  # aws_route53_record.wildcard_domain_record will be created%0A  + resource "aws_route53_record" "wildcard_domain_record" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "*.afeezadeboye.site"%0A      + records         = (known after apply)%0A      + ttl             = 300%0A      + type            = "A"%0A      + zone_id         = "Z0147908X57MCN3YH0SW"%0A    }%0A%0A  # aws_route_table_association.rt_association must be replaced%0A-/+ resource "aws_route_table_association" "rt_association" {%0A      ~ id             = "rtbassoc-0ee3ef3f1200008b3" -> (known after apply)%0A      ~ subnet_id      = "subnet-0d697670413be14ce" -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.public_subnet must be replaced%0A-/+ resource "aws_subnet" "public_subnet" {%0A      ~ arn                                            = "arn:aws:ec2:us-east-1:851725267635:subnet/subnet-0d697670413be14ce" -> (known after apply)%0A      ~ availability_zone                              = "us-east-1e" -> "us-east-1a" # forces replacement%0A      ~ availability_zone_id                           = "use1-az3" -> (known after apply)%0A      - enable_lni_at_device_index                     = 0 -> null%0A      ~ id                                             = "subnet-0d697670413be14ce" -> (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      ~ owner_id                                       = "851725267635" -> (known after apply)%0A      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)%0A        tags                                           = {%0A            "Name" = "MainSubnet"%0A        }%0A        # (12 unchanged attributes hidden)%0A    }%0A%0A  # local_file.ansible_inventory will be created%0A  + resource "local_file" "ansible_inventory" {%0A      + content              = (known after apply)%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "../ansible/inventory.ini"%0A      + id                   = (known after apply)%0A    }%0A%0A  # local_file.private_key will be created%0A  + resource "local_file" "private_key" {%0A      + content              = (sensitive value)%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0600"%0A      + filename             = "./devops-dojo"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 7 to add, 0 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  - db_domain         = "db.afeezadeboye.site" -> null%0A  - frontend_domain   = "afeezadeboye.site" -> null%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>

<details>
<summary>**💰 Cost Estimation Overview 💰**</summary>

```
Project: main

 Name                                                       Monthly Qty  Unit                  Monthly Cost   
                                                                                                              
 aws_instance.ec2                                                                                             
 ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)               730  hours                       $30.37   
 └─ root_block_device                                                                                         
    └─ Storage (general purpose SSD, gp2)                             8  GB                           $0.80   
                                                                                                              
 aws_route53_record.main_domain_record                                                                        
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.wildcard_domain_record                                                                    
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 OVERALL TOTAL                                                                                      $31.17 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
10 cloud resources were detected:
∙ 3 were estimated
∙ 7 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $31 ┃           - ┃        $31 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```
</details>

*Analysis triggered by @Afeez-AA*